# ANALISIS BOOKSTORE

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Leer el archivo txt y cargarlo en un DataFrame
df_store = pd.read_csv('bookshop-stores-sales.txt')
df_web = pd.read_csv('bookshop-web-sales.txt')

## PARTE 1
Entregue un reporte a la gerencia comercial, en Excel, donde contenga Tienda, Titulo, Cantidad vendida, Precio de venta y Royalty

### Bookshop Store

In [3]:
# inspección rápida de Store
df_store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Title       19 non-null     object
 1   Units sold  10 non-null     float64
 2   List price  10 non-null     float64
 3   Royalty     13 non-null     float64
dtypes: float64(3), object(1)
memory usage: 900.0+ bytes

In [4]:
# Buscar valores faltantes
df.isna().sum()

Title          5
Units sold    14
List price    14
Royalty       11
dtype: int64

In [9]:
# estandarización de valores faltantes
missing_tokens = ["--", "n/a", "na", "NA", "NaN", ""]
df = df.replace(missing_tokens, np.nan)
df.head()

                              Title  Units sold  List price  Royalty
0                               NaN         NaN         NaN      NaN
1               Sales report for Q4         NaN         NaN      NaN
2                 Bookshop US Store         NaN         NaN      NaN
3  Pining for the Fisheries of Yore        80.0        3.50    14.98
4                          Swimrand         1.0        2.99     0.14

In [10]:
# verificar faltantes despues de la estandarización
df.isna().sum()

Title          5
Units sold    14
List price    14
Royalty       11
dtype: int64

In [11]:
# eliminar filas duplicadas
duplicadas = df.duplicated().sum()
print("Filas duplicadas:", duplicadas)

if duplicadas > 0:
    df = df.drop_duplicates()

print("Filas, Columnas (después de duplicados):", df.shape)

Filas duplicadas: 6
Filas, Columnas (después de duplicados): (18, 4)

In [11]:
# Elimina las filas con 3 o más valores faltantes
df_clean = df[df.isna().sum(axis=1) <= 3]

In [12]:
df_clean

                               Title  Units sold  List price  Royalty
1                Sales report for Q4         NaN         NaN      NaN
2                  Bookshop US Store         NaN         NaN      NaN
3   Pining for the Fisheries of Yore        80.0        3.50    14.98
4                           Swimrand         1.0        2.99     0.14
5             The Bricklayer's Bible        17.0        3.50     5.15
6                 The Duck Goes Here        34.0        2.99     5.78
7        The Tower Commission Report         4.0        9.50     6.20
8                 US royalties (USD)         NaN         NaN    32.25
11               Sales report for Q4         NaN         NaN      NaN
12                 Bookshop UK Store         NaN         NaN      NaN
13  Pining for the Fisheries of Yore        47.0        2.99    11.98
14            The Bricklayer's Bible        17.0        2.99     3.50
15       The Tower Commission Report         4.0        6.50     4.80
16                UK royalties (GBP)         NaN         NaN    20.28
19               Sales report for Q4         NaN         NaN      NaN
20             Bookshop France Store         NaN         NaN      NaN
21                          Swimrand         8.0        1.99     0.88
22                The Duck Goes Here        12.0        1.99     1.50
23            France royalties (EUR)         NaN         NaN     2.38

In [13]:
# Crea la columna Store con valores NaN
df_clean['Store'] = np.nan

/tmp/ipykernel_7199/1090055609.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean['Store'] = np.nan

In [15]:
import re
p = re.compile('^([A-Za-z]*), (([A-Za-z]*))\. (([A-Za-z]*)) .*$')

<>:2: SyntaxWarning: invalid escape sequence '\.'
<>:2: SyntaxWarning: invalid escape sequence '\.'
/tmp/ipykernel_7199/373238259.py:2: SyntaxWarning: invalid escape sequence '\.'
  p = re.compile('^([A-Za-z]*), (([A-Za-z]*))\. (([A-Za-z]*)) .*$')